{
  "id": "first-dashboard-cloud",
  "title": "Create your first dashboard in Grafana Cloud",
  "blocks": [
    {
      "type": "markdown",
      "content": "# Create your first dashboard\n\nWelcome! In this tutorial, you'll learn how to create your first Grafana dashboard by following Jack and Jill on their hiking adventure. You'll start by exploring sample data in Explore, then transform that data into a beautiful visualization on a dashboard.\n\nBy the end of this tutorial, you'll understand how to query data, add labels to organize your metrics, and create meaningful visualizations that tell a story with your data."
    },
    {
      "type": "markdown",
      "content": "## Explore your data\n\nBefore building a dashboard, it's a good practice to explore your data first. Think of Explore as your data playground - it's where you can experiment with queries, understand what your data looks like, and test different approaches without committing to a dashboard.\n\nLet's start by tracking Jack and Jill's hiking altitude using sample data from Grafana's built-in TestData source."
    },
    {
      "type": "section",
      "id": "explore-tutorial",
      "title": "Explore your data",
      "blocks": [
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[data-testid=\"data-testid Nav menu item\"][href=\"/explore\"]",
          "requirements": ["navmenu-open", "exists-reftarget"],
          "content": "Navigate to **Explore** to begin querying data.",
          "tooltip": "Explore is Grafana's investigation workspace. Unlike dashboards which display predefined visualizations, Explore lets you freely query your data sources and see results immediately. This makes it perfect for experimenting and understanding your data before committing to a dashboard design."
        },
        {
          "type": "multistep",
          "content": "Select the **TestData** data source to work with sample data.",
          "requirements": ["on-page:/explore"],
          "objectives": ["has-datasource:testdata"],
          "steps": [
            {
              "action": "highlight",
              "reftarget": "input[data-testid=\"data-testid Select a data source\"]",
              "requirements": ["exists-reftarget"]
            },
            {
              "action": "highlight",
              "reftarget": "button:contains(\"grafana-testdata-datasource\")",
              "requirements": ["exists-reftarget"],
              "tooltip": "In real-world scenarios, you'd connect to data sources like Prometheus for metrics, Loki for logs, or databases like PostgreSQL. For learning purposes, Grafana includes TestData - a built-in data source that generates realistic sample data without requiring any external setup. This lets you practice building dashboards right away."
            }
          ]
        },
        {
          "type": "interactive",
          "action": "formfill",
          "reftarget": "input[id=\"test-data-scenario-select-A\"]",
          "targetvalue": "Random Walk",
          "requirements": ["on-page:/explore", "exists-reftarget"],
          "content": "Choose **Random Walk** to simulate Jack's hiking altitude data.",
          "tooltip": "Random Walk generates time series data that changes randomly over time, similar to how real metrics behave. Imagine tracking Jack's altitude as he climbs up and down hills - it goes up and down, but with natural variation. This type of data is perfect for simulating real-world metrics like CPU usage, temperature readings, or in our case, hiking altitude."
        },
        {
          "type": "interactive",
          "action": "formfill",
          "reftarget": "input[id=\"labels-A\"]",
          "targetvalue": "walker=jack",
          "requirements": ["on-page:/explore", "exists-reftarget"],
          "content": "Add the label **walker=jack** to identify Jack's hiking data.",
          "tooltip": "Labels are key-value pairs that add context to your data. Think of them as tags that help you identify and filter your metrics. In our hiking story, we'll use labels to distinguish between Jack and Jill's individual altitude measurements. This is exactly how you'd use labels in production - to distinguish between different servers, applications, or users."
        },
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "button:contains(\"Add query\")",
          "requirements": ["on-page:/explore", "exists-reftarget"],
          "content": "Click **Add query** to create a second data series for Jill.",
          "tooltip": "Now let's add Jill's hiking data! In Grafana, you can display multiple queries on the same graph to compare and contrast data. This is incredibly powerful - imagine comparing CPU usage across different servers, or in our case, comparing Jack and Jill's hiking altitudes to see who climbed higher."
        },
        {
          "type": "interactive",
          "action": "formfill",
          "reftarget": "input[id=\"labels-B\"]",
          "targetvalue": "walker=jill",
          "requirements": ["on-page:/explore", "exists-reftarget"],
          "content": "Add the label **walker=jill** to identify Jill's hiking data.",
          "tooltip": "Now we'll add Jill's label to the second query. By using the same label key (`walker`) but different values (`jack` vs `jill`), Grafana can automatically differentiate between the two data series in visualizations. This labeling strategy is a best practice in observability - it keeps your data organized and queryable."
        }
      ]
    },
    {
      "type": "markdown",
      "content": "## Create a dashboard\n\nGreat work! You've explored Jack and Jill's hiking data and set up two labeled queries. Now comes the exciting part - transforming this raw data into a permanent, shareable dashboard.\n\nDashboards are where your data comes to life. Unlike the temporary workspace of Explore, dashboards provide persistent visualizations that you and your team can reference anytime. Let's create your first one!"
    },
    {
      "type": "section",
      "id": "dashboard-section",
      "title": "Create a dashboard",
      "requirements": ["section-completed:section-explore-tutorial"],
      "blocks": [
        {
          "type": "multistep",
          "content": "Use the **Add** button to send your queries to a new dashboard.",
          "requirements": ["section-completed:section-explore-tutorial"],
          "steps": [
            {
              "action": "highlight",
              "reftarget": "button[aria-label=\"Add\"]",
              "requirements": ["exists-reftarget"]
            },
            {
              "action": "highlight",
              "reftarget": "button:contains(\"Add to dashboard\")",
              "requirements": ["exists-reftarget"]
            },
            {
              "action": "highlight",
              "reftarget": "button:contains(\"Open dashboard\")",
              "requirements": ["exists-reftarget"],
              "tooltip": "One of Grafana's best features is the seamless transition from Explore to dashboards. Instead of manually recreating your queries, you can send them directly from Explore to a new or existing dashboard. This workflow saves time and ensures your carefully crafted queries make it to your dashboard exactly as you tested them."
            }
          ]
        },
        {
          "type": "multistep",
          "content": "Open the panel editor to customize your visualization.",
          "steps": [
            {
              "action": "highlight",
              "reftarget": "button[data-testid=\"data-testid Panel menu New Panel\"]",
              "requirements": ["exists-reftarget"]
            },
            {
              "action": "highlight",
              "reftarget": "a[data-testid=\"data-testid Panel menu item Edit\"]",
              "requirements": ["exists-reftarget"],
              "tooltip": "Welcome to your new dashboard! The panel editor is where the magic happens. Each visualization on a dashboard is called a \"panel,\" and the panel editor gives you complete control over how your data looks and behaves. Let's customize this panel to better tell Jack and Jill's hiking story."
            }
          ]
        },
        {
          "type": "multistep",
          "content": "Change the visualization to **Bar chart** to compare altitudes.",
          "steps": [
            {
              "action": "highlight",
              "reftarget": "button[data-testid=\"data-testid toggle-viz-picker\"]",
              "requirements": ["exists-reftarget"]
            },
            {
              "action": "highlight",
              "reftarget": "div[data-testid=\"Plugin visualization item Bar chart\"]",
              "requirements": ["exists-reftarget"],
              "tooltip": "Choosing the right visualization is key to telling your data's story. Time series graphs show trends over time, stat panels display single values, tables show raw data, and bar charts compare values side by side. For comparing Jack and Jill's final altitudes, a bar chart makes the difference instantly clear - you can see at a glance who climbed higher!"
            }
          ]
        },
        {
          "type": "interactive",
          "action": "formfill",
          "reftarget": "input[data-testid=\"data-testid Panel editor option pane field input Title\"]",
          "targetvalue": "Jack and Jill Walk Altitude",
          "requirements": ["exists-reftarget"],
          "content": "Give your panel a clear title: **Jack and Jill Walk Altitude**.",
          "tooltip": "A good panel title transforms raw data into a story. Instead of generic names like \"Query A\" or \"Metric 1,\" use descriptive titles that immediately convey what the data represents. This is especially important when sharing dashboards with teammates who might not know the context. Your future self will thank you too!"
        },
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "input[id=\"barchart-unit\"]",
          "targetvalue": "ALT",
          "requirements": ["exists-reftarget"],
          "content": "We can give our walking data meaning by setting a unit.",
          "tooltip": "Units give meaning to numbers. Is that value 42 seconds, bytes, requests, or meters? Without units, numbers are just numbers. Grafana can automatically format values based on their units - bytes become KB/MB/GB, seconds become ms/s/m, and so on. This polish makes your dashboards professional and removes ambiguity."
        },
        {
          "type": "multistep",
          "content": "Click **Save Dashboard**, name it **Walking Adventure**, and click **Save**.",
          "steps": [
            {
              "action": "button",
              "reftarget": "Save Dashboard",
              "requirements": ["exists-reftarget"]
            },
            {
              "action": "formfill",
              "reftarget": "input[aria-label=\"Save dashboard title field\"]",
              "targetvalue": "Walking Adventure",
              "requirements": ["exists-reftarget"]
            },
            {
              "action": "button",
              "reftarget": "Save",
              "requirements": ["exists-reftarget"]
            }
          ]
        }
      ]
    },
    {
      "type": "markdown",
      "content": "## Congratulations!\n\nYou've just created your first Grafana dashboard! Let's recap what you learned:\n\n- **Explore first, dashboard later** - Use Explore to experiment with queries before committing them to dashboards.\n- **Labels organize your data** - Key-value pairs like `walker=jack` help you identify and filter time series data.\n- **Multiple queries tell richer stories** - Comparing data series reveals patterns and insights you'd miss looking at them individually.\n- **Visualization choice matters** - Bar charts for comparisons, time series for trends, tables for raw data - pick the right tool for your story.\n- **Polish makes perfect** - Clear titles and proper units transform raw data into professional, understandable dashboards."
    },
    {
      "type": "markdown",
      "content": "### What's next?\n\nNow that you understand the basics, you're ready to explore more:\n\n- **Try different visualizations** - Change your bar chart to a time series graph to see Jack and Jill's altitude over time.\n- **Add more panels** - Dashboards can contain many panels. Try adding another panel to show different aspects of the data.\n- **Connect real data sources** - The principles you learned with TestData apply to real sources like Prometheus, Loki, or databases.\n- **Explore transformations** - Learn how to calculate rates, aggregate data, and perform advanced data manipulation.\n\nRemember: every expert started exactly where you are now. The journey from first dashboard to complex monitoring systems is just a series of small steps, and you've taken the first one!"
    }
  ]
}
